perf/results/multinode/breakpoint/ping/run.log

> perf@1.0.0 artillery
> NODE_OPTIONS=--max-old-space-size=4096 artillery "run" "./results/multinode/breakpoint/cfg-breakpoint-ping.yaml" "-e" "ping"

Phase started: Ramp (index: 0, duration: 300s) 19:36:25(-0300)

--------------------------------------
Metrics for period to: 19:36:30(-0300) (width: 4.065s)
--------------------------------------

http.codes.200: ................................................................ 83
http.request_rate: ............................................................. 29/sec
http.requests: ................................................................. 84
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 36
  median: ...................................................................... 3
  p95: ......................................................................... 8.9
  p99: ......................................................................... 27.9
http.responses: ................................................................ 83
vusers.completed: .............................................................. 83
vusers.created: ................................................................ 84
vusers.created_by_name.Root (/): ............................................... 84
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.3
  max: ......................................................................... 113.5
  median: ...................................................................... 8.8
  p95: ......................................................................... 41.7
  p99: ......................................................................... 83.9


--------------------------------------
Metrics for period to: 19:36:40(-0300) (width: 9.977s)
--------------------------------------

http.codes.200: ................................................................ 557
http.request_rate: ............................................................. 57/sec
http.requests: ................................................................. 556
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 44
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 13.9
http.responses: ................................................................ 557
vusers.completed: .............................................................. 557
vusers.created: ................................................................ 556
vusers.created_by_name.Root (/): ............................................... 556
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.5
  max: ......................................................................... 46.5
  median: ...................................................................... 5.9
  p95: ......................................................................... 15
  p99: ......................................................................... 30.9


--------------------------------------
Metrics for period to: 19:36:50(-0300) (width: 9.987s)
--------------------------------------

http.codes.200: ................................................................ 1024
http.request_rate: ............................................................. 105/sec
http.requests: ................................................................. 1024
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 40
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 8.9
http.responses: ................................................................ 1024
vusers.completed: .............................................................. 1024
vusers.created: ................................................................ 1025
vusers.created_by_name.Root (/): ............................................... 1025
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 41.5
  median: ...................................................................... 7.5
  p95: ......................................................................... 13.6
  p99: ......................................................................... 18.7


--------------------------------------
Metrics for period to: 19:37:00(-0300) (width: 9.991s)
--------------------------------------

http.codes.200: ................................................................ 1562
http.request_rate: ............................................................. 159/sec
http.requests: ................................................................. 1562
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 26
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 8.9
http.responses: ................................................................ 1562
vusers.completed: .............................................................. 1562
vusers.created: ................................................................ 1561
vusers.created_by_name.Root (/): ............................................... 1561
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 38.5
  median: ...................................................................... 5.3
  p95: ......................................................................... 13.6
  p99: ......................................................................... 20.3


--------------------------------------
Metrics for period to: 19:37:10(-0300) (width: 9.996s)
--------------------------------------

http.codes.200: ................................................................ 2128
http.request_rate: ............................................................. 213/sec
http.requests: ................................................................. 2130
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 21
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
http.responses: ................................................................ 2128
vusers.completed: .............................................................. 2128
vusers.created: ................................................................ 2131
vusers.created_by_name.Root (/): ............................................... 2131
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 49.5
  median: ...................................................................... 4.6
  p95: ......................................................................... 13.3
  p99: ......................................................................... 22


--------------------------------------
Metrics for period to: 19:37:20(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 2510
http.request_rate: ............................................................. 252/sec
http.requests: ................................................................. 2508
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 33
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 8.9
http.responses: ................................................................ 2510
vusers.completed: .............................................................. 2510
vusers.created: ................................................................ 2509
vusers.created_by_name.Root (/): ............................................... 2509
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.8
  max: ......................................................................... 52.1
  median: ...................................................................... 4.1
  p95: ......................................................................... 12.6
  p99: ......................................................................... 22


--------------------------------------
Metrics for period to: 19:37:30(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 3020
http.request_rate: ............................................................. 303/sec
http.requests: ................................................................. 3021
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 54
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 13.1
http.responses: ................................................................ 3020
vusers.completed: .............................................................. 3020
vusers.created: ................................................................ 3019
vusers.created_by_name.Root (/): ............................................... 3019
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.8
  max: ......................................................................... 98.6
  median: ...................................................................... 5.1
  p95: ......................................................................... 16.6
  p99: ......................................................................... 27.4


--------------------------------------
Metrics for period to: 19:37:40(-0300) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 3523
http.request_rate: ............................................................. 353/sec
http.requests: ................................................................. 3522
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 37
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
http.responses: ................................................................ 3523
vusers.completed: .............................................................. 3523
vusers.created: ................................................................ 3524
vusers.created_by_name.Root (/): ............................................... 3524
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 55.5
  median: ...................................................................... 3.8
  p95: ......................................................................... 11.6
  p99: ......................................................................... 19.1


--------------------------------------
Metrics for period to: 19:37:50(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 4112
http.request_rate: ............................................................. 413/sec
http.requests: ................................................................. 4119
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 158
  median: ...................................................................... 7
  p95: ......................................................................... 37.7
  p99: ......................................................................... 74.4
http.responses: ................................................................ 4112
vusers.completed: .............................................................. 4112
vusers.created: ................................................................ 4119
vusers.created_by_name.Root (/): ............................................... 4119
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.6
  max: ......................................................................... 165.4
  median: ...................................................................... 8.2
  p95: ......................................................................... 44.3
  p99: ......................................................................... 80.6


--------------------------------------
Metrics for period to: 19:38:00(-0300) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 4610
http.request_rate: ............................................................. 461/sec
http.requests: ................................................................. 4608
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 558
  median: ...................................................................... 7.9
  p95: ......................................................................... 210.6
  p99: ......................................................................... 354.3
http.responses: ................................................................ 4610
vusers.completed: .............................................................. 4610
vusers.created: ................................................................ 4606
vusers.created_by_name.Root (/): ............................................... 4606
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 560.6
  median: ...................................................................... 9.9
  p95: ......................................................................... 219.2
  p99: ......................................................................... 368.8


--------------------------------------
Metrics for period to: 19:38:10(-0300) (width: 9.995s)
--------------------------------------

http.codes.200: ................................................................ 4801
http.request_rate: ............................................................. 497/sec
http.requests: ................................................................. 4963
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 695
  median: ...................................................................... 7.9
  p95: ......................................................................... 314.2
  p99: ......................................................................... 528.6
http.responses: ................................................................ 4801
vusers.completed: .............................................................. 4801
vusers.created: ................................................................ 4969
vusers.created_by_name.Root (/): ............................................... 4969
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.4
  max: ......................................................................... 712.7
  median: ...................................................................... 9.9
  p95: ......................................................................... 314.2
  p99: ......................................................................... 528.6


--------------------------------------
Metrics for period to: 19:38:20(-0300) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 5370
http.request_rate: ............................................................. 553/sec
http.requests: ................................................................. 5518
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1272
  median: ...................................................................... 10.1
  p95: ......................................................................... 528.6
  p99: ......................................................................... 788.5
http.responses: ................................................................ 5370
vusers.completed: .............................................................. 5370
vusers.created: ................................................................ 5514
vusers.created_by_name.Root (/): ............................................... 5514
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 1305.3
  median: ...................................................................... 12.3
  p95: ......................................................................... 550.1
  p99: ......................................................................... 804.5


--------------------------------------
Metrics for period to: 19:38:30(-0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 6300
http.request_rate: ............................................................. 614/sec
http.requests: ................................................................. 6135
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1505
  median: ...................................................................... 63.4
  p95: ......................................................................... 658.6
  p99: ......................................................................... 889.1
http.responses: ................................................................ 6300
vusers.completed: .............................................................. 6300
vusers.created: ................................................................ 6136
vusers.created_by_name.Root (/): ............................................... 6136
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.6
  max: ......................................................................... 1506.8
  median: ...................................................................... 73
  p95: ......................................................................... 671.9
  p99: ......................................................................... 907


--------------------------------------
Metrics for period to: 19:38:40(-0300) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 2
http.codes.200: ................................................................ 6539
http.request_rate: ............................................................. 654/sec
http.requests: ................................................................. 6515
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1172
  median: ...................................................................... 68.7
  p95: ......................................................................... 671.9
  p99: ......................................................................... 925.4
http.responses: ................................................................ 6539
vusers.completed: .............................................................. 6539
vusers.created: ................................................................ 6518
vusers.created_by_name.Root (/): ............................................... 6518
vusers.failed: ................................................................. 2
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 1174.1
  median: ...................................................................... 80.6
  p95: ......................................................................... 685.5
  p99: ......................................................................... 925.4


--------------------------------------
Metrics for period to: 19:38:50(-0300) (width: 9.995s)
--------------------------------------

errors.ECONNRESET: ............................................................. 6
http.codes.200: ................................................................ 4946
http.request_rate: ............................................................. 700/sec
http.requests: ................................................................. 6929
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 3589
  median: ...................................................................... 982.6
  p95: ......................................................................... 2465.6
  p99: ......................................................................... 2951.9
http.responses: ................................................................ 4946
vusers.completed: .............................................................. 4946
vusers.created: ................................................................ 6925
vusers.created_by_name.Root (/): ............................................... 6925
vusers.failed: ................................................................. 6
vusers.session_length:
  min: ......................................................................... 8.9
  max: ......................................................................... 3603.2
  median: ...................................................................... 1002.4
  p95: ......................................................................... 2515.5
  p99: ......................................................................... 3011.6


--------------------------------------
Metrics for period to: 19:39:00(-0300) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 4558
http.request_rate: ............................................................. 777/sec
http.requests: ................................................................. 7617
http.response_time:
  min: ......................................................................... 1759
  max: ......................................................................... 7690
  median: ...................................................................... 4676.2
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 6439.7
http.responses: ................................................................ 4558
vusers.completed: .............................................................. 4558
vusers.created: ................................................................ 7621
vusers.created_by_name.Root (/): ............................................... 7621
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1778.4
  max: ......................................................................... 7708
  median: ...................................................................... 4676.2
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 6439.7


--------------------------------------
Metrics for period to: 19:39:10(-0300) (width: 9.995s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 572
http.codes.200: ................................................................ 4591
http.request_rate: ............................................................. 797/sec
http.requests: ................................................................. 7946
http.response_time:
  min: ......................................................................... 4652
  max: ......................................................................... 10014
  median: ...................................................................... 8186.6
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 4591
vusers.completed: .............................................................. 4591
vusers.created: ................................................................ 7942
vusers.created_by_name.Root (/): ............................................... 7942
vusers.failed: ................................................................. 572
vusers.session_length:
  min: ......................................................................... 4669.8
  max: ......................................................................... 10016.3
  median: ...................................................................... 8186.6
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 19:39:20(-0300) (width: 9.997s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7538
http.codes.200: ................................................................ 393
http.request_rate: ............................................................. 848/sec
http.requests: ................................................................. 8451
http.response_time:
  min: ......................................................................... 8319
  max: ......................................................................... 10013
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 393
vusers.completed: .............................................................. 393
vusers.created: ................................................................ 8452
vusers.created_by_name.Root (/): ............................................... 8452
vusers.failed: ................................................................. 7538
vusers.session_length:
  min: ......................................................................... 8827
  max: ......................................................................... 10018.1
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 19:39:30(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 8458
http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 900/sec
http.requests: ................................................................. 8992
http.response_time:
  min: ......................................................................... 9968
  max: ......................................................................... 9968
  median: ...................................................................... 9999.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 8992
vusers.created_by_name.Root (/): ............................................... 8992
vusers.failed: ................................................................. 8458
vusers.session_length:
  min: ......................................................................... 9972.9
  max: ......................................................................... 9972.9
  median: ...................................................................... 9999.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 19:39:40(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 8988
http.codes.200: ................................................................ 3
http.request_rate: ............................................................. 869/sec
http.requests: ................................................................. 8688
http.response_time:
  min: ......................................................................... 9947
  max: ......................................................................... 9989
  median: ...................................................................... 9999.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 3
vusers.completed: .............................................................. 3
vusers.created: ................................................................ 8689
vusers.created_by_name.Root (/): ............................................... 8689
vusers.failed: ................................................................. 8988
vusers.session_length:
  min: ......................................................................... 9972.9
  max: ......................................................................... 9994.5
  median: ...................................................................... 9999.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 19:39:50(-0300) (width: 9.996s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 8672
http.codes.200: ................................................................ 6
http.request_rate: ............................................................. 1049/sec
http.requests: ................................................................. 10474
http.response_time:
  min: ......................................................................... 9084
  max: ......................................................................... 9982
  median: ...................................................................... 9999.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 6
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 10476
vusers.created_by_name.Root (/): ............................................... 10476
vusers.failed: ................................................................. 8672
vusers.session_length:
  min: ......................................................................... 9138.6
  max: ......................................................................... 10001.2
  median: ...................................................................... 9999.2
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 19:40:00(-0300) (width: 9.998s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 10483
http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 1007/sec
http.requests: ................................................................. 10030
http.response_time:
  min: ......................................................................... 9378
  max: ......................................................................... 9378
  median: ...................................................................... 9416.8
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9416.8
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 10030
vusers.created_by_name.Root (/): ............................................... 10030
vusers.failed: ................................................................. 10483
vusers.session_length:
  min: ......................................................................... 9407.1
  max: ......................................................................... 9407.1
  median: ...................................................................... 9416.8
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9416.8


--------------------------------------
Metrics for period to: 19:40:10(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 10031
http.codes.200: ................................................................ 3
http.request_rate: ............................................................. 976/sec
http.requests: ................................................................. 9746
http.response_time:
  min: ......................................................................... 9683
  max: ......................................................................... 9854
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9801.2
http.responses: ................................................................ 3
vusers.completed: .............................................................. 3
vusers.created: ................................................................ 9745
vusers.created_by_name.Root (/): ............................................... 9745
vusers.failed: ................................................................. 10031
vusers.session_length:
  min: ......................................................................... 9715.3
  max: ......................................................................... 9885.2
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9801.2


--------------------------------------
Metrics for period to: 19:40:20(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 9084
http.codes.200: ................................................................ 1134
http.request_rate: ............................................................. 904/sec
http.requests: ................................................................. 9016
http.response_time:
  min: ......................................................................... 6498
  max: ......................................................................... 9992
  median: ...................................................................... 7865.6
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 1134
vusers.completed: .............................................................. 1134
vusers.created: ................................................................ 9018
vusers.created_by_name.Root (/): ............................................... 9018
vusers.failed: ................................................................. 9084
vusers.session_length:
  min: ......................................................................... 6603.4
  max: ......................................................................... 10006.9
  median: ...................................................................... 8868.4
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 19:40:30(-0300) (width: 9.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7265
http.codes.200: ................................................................ 1640
http.request_rate: ............................................................. 781/sec
http.requests: ................................................................. 7800
http.response_time:
  min: ......................................................................... 7277
  max: ......................................................................... 10003
  median: ...................................................................... 8692.8
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 1640
vusers.completed: .............................................................. 1640
vusers.created: ................................................................ 7795
vusers.created_by_name.Root (/): ............................................... 7795
vusers.failed: ................................................................. 7265
vusers.session_length:
  min: ......................................................................... 7321.2
  max: ......................................................................... 10015.1
  median: ...................................................................... 9230.4
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2


--------------------------------------
Metrics for period to: 19:40:40(-0300) (width: 9.999s)
--------------------------------------

errors.ECONNRESET: ............................................................. 2
errors.ETIMEDOUT: .............................................................. 6051
http.codes.200: ................................................................ 1375
http.request_rate: ............................................................. 995/sec
http.requests: ................................................................. 9944
http.response_time:
  min: ......................................................................... 7561
  max: ......................................................................... 9986
  median: ...................................................................... 8868.4
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 1375
vusers.completed: .............................................................. 1375
vusers.created: ................................................................ 9944
vusers.created_by_name.Root (/): ............................................... 9944
vusers.failed: ................................................................. 6053
vusers.session_length:
  min: ......................................................................... 7648.4
  max: ......................................................................... 10038.5
  median: ...................................................................... 9416.8
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2